// let a = '測試'
// let b = ''
// for(let i=0 ;i<100;i++){
//       b=b+a
// }
// console.log(b);


const A = '測試123測試123測試123123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試123測試'
const B = A.match(/.{5}/g); 

console.log(B.length); 
console.log(B); 

